    //===========================================  Prometheus Front-End ================================================================




    //==============================================  ПЕРВАЯ НЕДЕЛЯ ===================================================================

/* Роадмап фронтендера - https://roadmap.sh/roadmaps/frontend.png . Этот курс будет охватывать основы для фронтенд разработчика на карте
    это все блоки до центрального блока - web security knowledge. Все остальное не факт что пригодится, так что нужно учить только
    то что нужно для работы в текущий момент или перспективное(для продвижения карьеры/работы над новый проектом), а не хвататься за
    все подряд, а то получится что можно знать много поверхностно. Также нужно очень много практиковаться что бы теория не забывалась
    и получать новый опыт при разработке и дебаггинге(поиске ошибок) кода. */

         
    
{//    ====    ЭФФЕКТИВНЫЙ ПРОЦЕСС РАЗРАБОТКИ     ====

    Для того чтобы писать код эффективно нужно настроить и автоматизировать этот процесс. Это состоит из нескольких частей:
        - настройка среды разработки
        - Поиск информации
        - 





}



































