/* 
    //===========================================  Prometheus Front-End ================================================================



    //==============================================  Первая неделя ===================================================================

    Роадмап фронтендера - https://roadmap.sh/roadmaps/frontend.png . Этот курс будет охватывать основы для фронтенд разработчика на карте
        это все блоки до центрального блока - web security knowledge. Все остальное не факт что пригодится, так что нужно учить только
        то что нужно для работы в текущий момент или перспективное(для продвижения карьеры/работы над новый проектом), а не хвататься за
        все подряд, а то получится что можно знать много поверхностно.



































*/
